/*
	Resulting theme object parsing && building

	OPTION 1
	//{themeName: [theme,key,words]}
	...translatable to figuring out key-word-to-themes && 
		having run-tum connect the themes in the sentences
	...big O is complex
	..great at run-time for this one!

	PROBLEM / slowness here:
		if a single theme (i.e 'unity') has MANY key-words,
			looping through the one key will take a long time each sentence
	
	{
		patriotism: ['president'],  //1
		thankful: ['thank'],				//1
		unity, ['we', 'together'],	//2, 3, 4
		change : [rebuild, restore],//2
		pessimism: hardship, 				//5
		comparison: but 						//5
	}


	OPTION 2
	
	{1: [patriotism, thankful]}
	{2: [unity, change]}
	3: unity
	4: unity

	...not useful for run-time analysis
	...big O is less complex
	// 1 : [water, mmelon, chicken, grtiz]



	frontend logic ...(store this data)
	-ON AREA-CHANGE:
		populate area-list
		- get selected sentences array (sentence numbers no more?... not sure here...)
		- grab option-2 array-of-arrays (index-to-sentence number automagic)
		- Grab themes from the array positions [sentenceStart, sentenceEnd]
		- Show in theme-list

	-ON-THEME-CLICK, to text-blob-highlight
		- click a theme
		- use option-1-object {them: [...keywords]}
		- ket keywords from theme-key ('thankful') returns thank
		
		- regex.match the text-blob
			- capture the sentence ** unique, different from previous regex work
		
		- return sentence with a special-class


		idea for adding theme content to the text file
		~!~Array-of-Array Option-2 Theme-Content-Here~!~
		~!~[["one","two"],["three","four"]]~!~
		- split the text @ ~!~, only use the text part
		- json.parse the ~!~ array 


	NOTES:
	option 1 at run-time
	option 2 ONCE,





theme-box


- get selected sentence arr
	[0, 5]

- get themesArr
[
  [
    "Patriotism",
    "Thankful"
  ],
  [
    "timeframe",
    "unity",
    "change"
  ],
  [
    "unity"
  ],
  [
    "we"
  ],
  [
    "unity",
    "pessimism",
    "comparison"
  ]
]

- loop through && condense themes into single list of themes
let resList = []

//LOOP
	for(let i = startSentenceNumber; i < endSEntenceNumber; i++){
		resList = [
			...resList,
			...themesArr[i]
		]
	}

resList = [...new Set(resList)]







	1.
	Chief Justice Roberts, President Carter, 
		President Clinton, President Bush, President Obama, 
		fellow Americans, and people of the world, thank you.

		Patriotism
			President
		Thankful
			thank
	['Patriotism','Thankful']

	2.
		We the citizens of America are now joined in a great 
			national effort to rebuild our country and restore
			 its promise for all of our people.
		timeframe
			now
		Unity
			We
			join*ed
		Change
			rebuild, restore

	3.
		Together we will determine the course of America, 
		and the world, for many, many years to come.

		Unity
			Together

	4.
		We will face challenges
		Unity
			we

	5.
		We will confront hardships, but we will get the job done.
		unity
			we
		Pessimism?
			hardships
		comparison
			but
		
	6.
		Every four years, we gather on these steps to carry out the 
			orderly and peaceful transfer of power, and we are grateful 
			to President Obama and First Lady Michelle Obama for their 
			gracious aid throughout this transition.

		History
			"every four years..."
		Thankful
			grateful
			gracious
			magnificent
		Respect
			President
	7.
		They have been magnificent.
		Awe
			magnificent
	8. 
		Thank you.

		Thankful
			thank you
	9.
		Today's ceremony, however, has very special meaning, because 
		today we are not merely transferring power from one administration 
		to another, or from one party to another, but we are transferring 
		power from Washington, D.C., and giving it back to you, the people.

		Power
			power
		Authority
			"transferring power"

	10. 
		For too long, a small group in our nation's capital has reaped 
		the rewards of government, while the people have borne the cost.

		Power
			rewards
			borne

	11.
		Washington flourished, but the people did not share in its wealth. 
		Comparison
			but
	12.
		Politicians prospered, but the jobs left and the factories closed.
		Comparison
			but
		Politics
			politicians

	13.
		The establishment protected itself, but not the citizens of our country.
		politics
			establishment
	14.
		Their victories have not been your victories.
		Winning
			victories
	15.
		Their triumphs have not been your triumphs, and while they celebrated 
		in our nation's capital, there was little to celebrate for struggling 
		families all across our land.
		
		Winning
			triumphs
		Celebration
			celebrate
		Families

	16.
		That all changes, starting right here and right now, 
		because this moment is your moment --- it belongs to you.
		Timeframe
			starting
			now
		Change
			changes
		ownership
			belongs

	17.
		It belongs to everyone gathered here today, and everyone watching,
		 all across America.
		Patriotism
			America
		Ownership
			belongs

	18. This is your day.

	19. This is your celebration, and this, the United States of America, is your country.
		Patriotism
			America
		Celebration
			celebration

	20. What truly matters is not which party controls our government, but whether
	 our government is controlled by the people.

	Power
		controls
	Government
		Goernment

	21. January 20th, 2017 will be remembered as the day the people 
		became the rulers of this nation again.

	Power
		rulers
	Repetition**
		again

	22. The forgotten men and women of our country, will be forgotten no longer.
		change
		remembrance


	23. Everyone is listening to you now.
		attention
		timeframe
			now

	24. You came by the tens of millions to become part of a historic movement, the likes of which the world has never seen before.
		amazement
		awe
			historic
		volume
			millions
		change
			movement
		timeframe
			never
	
	25. At the center of this movement is a crucial conviction, that a nation exists to serve its citizens.
		focus
			center
			crucial
		change
			movement
		government
			nation
			serve

	26. Americans want great schools for their children, safe neighborhoods for 
		their families, and good jobs for themselves. 
		Family
			children
			families
		Education
			school
		community
			neighborhoods
		economy
			jobs
		quality
			safe
			good

	27. These are just and reasonable demands of righteous people and a righteous public, 
		but for too many of our citizens a different reality exists. 
		quality
			reasonable
		control
			demands
		religious
			righteous
		comparison
			but



	28. Mothers and children trapped in poverty in our inner cities, rusted out factories, 
		scattered like tombstones across the across the landscape of our nation, 
		an education system flush with cash, but which leaves our young and beautiful students 
		deprived of all knowledge, and the crime, and the gangs, and the drugs that have stolen too many lives 
		and robbed our country of so much unrealized potential. 

		Family
			mothers
			children
		grim
			trapped
			rusted out factories
			scattered like tombstones
			deprived
			robbed
			unrealized potential
		economy
			poverty
		socio-economic
			inner cities
		jobs
			factories
		education
			education + system
			knowledge

	29. This American carnage stops right here and stops right now.
		patriotism
			American
		grim
			carnage
		change
			stops
		timeframe
			now

	30. We are one nation and their pain is our pain. 
		patriotism
			nation
		other
			their

	31. Their dreams are our dreams and their success will be our success. 
		other
			their
		economy
			success

	32. We share one heart, one home, and one glorious destiny. 
		community
			share
		family
			home
		fate
			destiny

	33. The oath of office, I take today, is an oath of allegiance to all Americans. 
		government
			oath of office
			allegiance
		patriotism
			americans

	34. For many decades, we've enriched foreign industry at the expense of American 
		industry, subsidized the armies of other countries, while allowing for the 
		very sad depletion of our military. 

		history
			decades
		economics
			industry (2x)
		patriotism
			american
		government
			subsidized
			military
		other
			other countries
		grim
			depletions

	35. We've defended other nation's borders while refusing to defend our own. 
		separation
			border
		fight
			defended
		other
			other nation's borders

	36. And spent trillions and trillions of dollars overseas, while America's 
		infrastructure has fallen into disrepair and decay.
		Patriotism
			America's
		economy
			infrastructure
		grim
			disrepair
				decay

	37. We've made other countries rich while the wealth, strength and confidence 
	of our country has dissipated over the horizon. 
		power
			wealth
			strength
			confidence
		grim
			dissipated

	38. One by one, the factories shuddered and left our shores, with not even a 
	thought about the millions and millions of American workers that were left behind. 
	
	economy
		factories
	grim
		shuddered

	39. The wealth of our middle class has been ripped from their homes and then 
	redistributed all across the world.

	money, wealth
		wealth
	grim
		ripped
	class
		class

	40. But that is the past, and now we are looking only to the future. 

	timeframe
		now
	change
		but

	41. We assembled here today our issuing a new decree to be heard in every city, 
	in every foreign capital, and in every hall of power, from this day forward: 
	a new vision will govern our land, from this day forward, 
	it's going to be only America first. 

	purpose
		issuing
	change
		new 
		forward
		going
	patriotism
		America

	42. America first.
		Patriotism
			America

	43. Every decision on trade, on taxes, on immigration, on foreign affairs 
	will be made to benefit American workers and American families.
		economy
			trade
			taxes
			foreign
			workers
		community
			immigration
			families
		Patriotism
			American

	44. We must protect our borders from the ravages of other countries making 
	our products, stealing our companies and destroying our jobs. 
	protection
		protect
	security
		borders
	pessimism
		ravages
		stealing
		destroying
	economy
		jobs

	45. Protection will lead to great prosperity and strength. 
	security
		protection
	economy
		prosperity
	power
		strength

	46. I will fight for you with every breath in my body, and I will never, 
	ever let you down. 
	confrontation
		fight
	timeframe
		never

	47. America will start winning again, winning like never before. 
	patriotism
		america
	success
		winning
	timeframe
		start
	timeframe
		never

	48. We will bring back our jobs. 
	unity
		we
	economy
		jobs
		
	49. We will bring back our borders. 
	unity
		we
	security
		borders

	50. We will bring back our wealth, and we will bring back our dreams.
	unity
		we
	economy
		wealth
	idealism
		dreams

	51. We will build new roads and highways and bridges and airports and tunnels, 
	and railways, all across our wonderful nation. 
	unity
		we
	process
		build
	infrastructure
		roads
		highways
		bridges
		airports
		tunnels
		railways
	patriotism
		nation
	
	52. We will get our people off of welfare and back to work, rebuilding our 
	country with American hands and American labor.
	unity
		we
	government
		welfare
	economy
		work
		labor
	patriotism
		American

	53. We will follow two simple rules: buy American, and hire American. 
	unity
		we
	patriotism
		american
	economy
		buy
		hire

	54. We will seek friendship and goodwill with the nations of the world, but we 
	do so with the understanding that it is the right of all nations to put their 
	own interests first. 
	unity
		we
	community
		friendship
	priority
		first

	55. We do not seek to impose our way of life on anyone, but rather to let it shine 
	as an example.
	unity
		we
	control
		impose
	comparison
		but
	leadership
		example

	56. We will shine for everyone to follow. 
	unity
		we
	leadership
		follow

	57. We will reinforce old alliances and form new ones, and you unite the civilized 
	world against radical Islamic terrorism, which we will eradicate completely from 
	the face of the Earth.
	international affairs
		alliances
	unity
		we
		unite
	pessimism
		radical

	58. At the bedrock of our politics will be a total allegiance to the United States 
	of America, and through our loyalty to our country, we will rediscover our loyalty 
	to each other. 
	politics
		politics
	patriotism
		america
	power
		loyalty
		allegiance		

	59. When you open your heart to patriotism, there is no room for prejudice. 
	empathy
		heart
	patriotism
		patriotism
	pessimism
		prejudice

	60. The Bible tells us, how good and pleasant it is when God's people live together 
	in unity. 
	Faith
		bible
	positivity
		good
		pleasant
	unity
		people

	61. We must speak our minds openly, debate our disagreements, but always pursue 
	solidarity. 
	unity
		we
		solidarity
	timeframe
		always

	62. When America is united, America is totally unstoppable. 
	patriotism
		america
	unity
		united
	power
		unstoppable

	63. There should be no fear. 
	fear
		fear

	64. We are protected, and we will always be protected. 
	protection
		protected
	unity
		we
	timeframe
		always

	65. We will be protected by the great men and women of our military and law enforcement. 
	unity
		we
	protection
		protected
	power
		military
		enforcement

	66. And most importantly, we will be protected by God.
	unity
		we
	protection
		protected
	faith
		god
		
	67. Finally, we must think big and dream even bigger. 
	idealism
		dream

	68. In America, we understand that a nation is only 
	living as long as it is striving. 
	Patriotism
		America

	69. We will no longer accept politicians who are all talk and no action, constantly 
	complaining but never doing anything about it. 
	politics
		politicians
	negitivity
		complaining
	timeframe
		never


	70. The time for empty talk is over. 
	timeframe
		over

	71. Now arrives the hour of action. 
	timeframe
		now
		arrives


	72. Do not allow anyone to tell you that it cannot be done. 
	timeframe
		done

	73. No challenge can match the heart and fight and spirit of America. 
	patriotism
		America
	
	74. We will not fail. 
	success
		fail

	75. Our country will thrive and prosper again.
	success
		thrive
		prosper

	76. We stand at the birth of a new millennium, ready to unlock the mysteries of space, 
	to free the Earth from the miseries of disease and to harness the industries and 
	technologies of tomorrow. 
	Unity
		we
	change
		unlock
	freedom
		free
	pessimism
		miseries
	economy
		industries
		technologies

	77. A new national pride will stir our souls, lift our sights and heal our divisions. 
	patriotism
		national
	positivity
		lift
		heal

	78. It's time to remember that old wisdom our soldiers will never forget, that whether 
	we are black, or brown, or white, we all bleed the same red blood of patriots. 
	patriotism
		patriots
	past
		remember
	timeframe
		never

	79. We all enjoy the same glorious freedoms, and we all salute the same, great American flag. 
	positivity
		enjoy
	patriotism
		american
		flag
		salute

	80. And whether a child is born in the urban sprawl of Detroit or the windswept plains 
	of Nebraska, they look up at the at the same night sky, they fill their heart with the 
	same dreams and they are infused with the breath of life by the same almighty creator.
	Family
		child

	81. So to all Americans, in every city near and far, small and large, from mountain to 
	mountain, from ocean to ocean, hear these words. 
	patriotism
		americans

	82. You will never be ignored again. Your voice, your hopes, and your dreams will 
	define our American destiny. 
	patriotism
		american
	timeframe
		never


	83. And your courage and goodness and love, will forever guide us along the way. 
	

	84. Together, we will make America strong again. 

	85. We will make America wealthy again. 

	86. We will make America proud again We will make America safe again, And yes, together, we will make we will make America great again. 

	87. Thank you. 

	88. God bless you. 

	89. And god bless America. 

	90. Thank you. 

	91. God bless America.


	{
		ThemeWord: {
			theme-key-word-from-text: [sentenceNumber]
		}
	}
	
	to do this by computer... not by hand...

	Come up with Theme-Words && text that 'point' to the theme word
	
	Power
		strength 
		courage
		endurance
		then... regex the speech
*/
